SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_smu.h
/* Bit fields for SMU PPUPATD1 */
#define _SMU_PPUPATD1_RESETVALUE              0x03FFFFFFUL                              /**< Default value for SMU_PPUPATD1              */
#define _SMU_PPUPATD1_MASK                    0x03FFFFFFUL                              /**< Mask for SMU_PPUPATD1                       */
#define SMU_PPUPATD1_SYSRTC                   (0x1UL << 0)                              /**< SYSRTC Privileged Access                    */
#define _SMU_PPUPATD1_SYSRTC_SHIFT            0                                         /**< Shift value for SMU_SYSRTC                  */
#define _SMU_PPUPATD1_SYSRTC_MASK             0x1UL                                     /**< Bit mask for SMU_SYSRTC                     */
#define _SMU_PPUPATD1_SYSRTC_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_SYSRTC_DEFAULT           (_SMU_PPUPATD1_SYSRTC_DEFAULT << 0)       /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_LCD                      (0x1UL << 1)                              /**< LCD Privileged Access                       */
#define _SMU_PPUPATD1_LCD_SHIFT               1                                         /**< Shift value for SMU_LCD                     */
#define _SMU_PPUPATD1_LCD_MASK                0x2UL                                     /**< Bit mask for SMU_LCD                        */
#define _SMU_PPUPATD1_LCD_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_LCD_DEFAULT              (_SMU_PPUPATD1_LCD_DEFAULT << 1)          /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_KEYSCAN                  (0x1UL << 2)                              /**< KEYSCAN Privileged Access                   */
#define _SMU_PPUPATD1_KEYSCAN_SHIFT           2                                         /**< Shift value for SMU_KEYSCAN                 */
#define _SMU_PPUPATD1_KEYSCAN_MASK            0x4UL                                     /**< Bit mask for SMU_KEYSCAN                    */
#define _SMU_PPUPATD1_KEYSCAN_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_KEYSCAN_DEFAULT          (_SMU_PPUPATD1_KEYSCAN_DEFAULT << 2)      /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_DMEM                     (0x1UL << 3)                              /**< DMEM Privileged Access                      */
#define _SMU_PPUPATD1_DMEM_SHIFT              3                                         /**< Shift value for SMU_DMEM                    */
#define _SMU_PPUPATD1_DMEM_MASK               0x8UL                                     /**< Bit mask for SMU_DMEM                       */
#define _SMU_PPUPATD1_DMEM_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_DMEM_DEFAULT             (_SMU_PPUPATD1_DMEM_DEFAULT << 3)         /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_SMU                      (0x1UL << 7)                              /**< SMU Privileged Access                       */
#define _SMU_PPUPATD1_SMU_SHIFT               7                                         /**< Shift value for SMU_SMU                     */
#define _SMU_PPUPATD1_SMU_MASK                0x80UL                                    /**< Bit mask for SMU_SMU                        */
#define _SMU_PPUPATD1_SMU_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_SMU_DEFAULT              (_SMU_PPUPATD1_SMU_DEFAULT << 7)          /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_SMUCFGNS                 (0x1UL << 8)                              /**< SMUCFGNS Privileged Access                  */
#define _SMU_PPUPATD1_SMUCFGNS_SHIFT          8                                         /**< Shift value for SMU_SMUCFGNS                */
#define _SMU_PPUPATD1_SMUCFGNS_MASK           0x100UL                                   /**< Bit mask for SMU_SMUCFGNS                   */
#define _SMU_PPUPATD1_SMUCFGNS_DEFAULT        0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_SMUCFGNS_DEFAULT         (_SMU_PPUPATD1_SMUCFGNS_DEFAULT << 8)     /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_LETIMER0                 (0x1UL << 9)                              /**< LETIMER0 Privileged Access                  */
#define _SMU_PPUPATD1_LETIMER0_SHIFT          9                                         /**< Shift value for SMU_LETIMER0                */
#define _SMU_PPUPATD1_LETIMER0_MASK           0x200UL                                   /**< Bit mask for SMU_LETIMER0                   */
#define _SMU_PPUPATD1_LETIMER0_DEFAULT        0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_LETIMER0_DEFAULT         (_SMU_PPUPATD1_LETIMER0_DEFAULT << 9)     /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_IADC0                    (0x1UL << 10)                             /**< IADC0 Privileged Access                     */
#define _SMU_PPUPATD1_IADC0_SHIFT             10                                        /**< Shift value for SMU_IADC0                   */
#define _SMU_PPUPATD1_IADC0_MASK              0x400UL                                   /**< Bit mask for SMU_IADC0                      */
#define _SMU_PPUPATD1_IADC0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_IADC0_DEFAULT            (_SMU_PPUPATD1_IADC0_DEFAULT << 10)       /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_ACMP0                    (0x1UL << 11)                             /**< ACMP0 Privileged Access                     */
#define _SMU_PPUPATD1_ACMP0_SHIFT             11                                        /**< Shift value for SMU_ACMP0                   */
#define _SMU_PPUPATD1_ACMP0_MASK              0x800UL                                   /**< Bit mask for SMU_ACMP0                      */
#define _SMU_PPUPATD1_ACMP0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_ACMP0_DEFAULT            (_SMU_PPUPATD1_ACMP0_DEFAULT << 11)       /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_ACMP1                    (0x1UL << 12)                             /**< ACMP1 Privileged Access                     */
#define _SMU_PPUPATD1_ACMP1_SHIFT             12                                        /**< Shift value for SMU_ACMP1                   */
#define _SMU_PPUPATD1_ACMP1_MASK              0x1000UL                                  /**< Bit mask for SMU_ACMP1                      */
#define _SMU_PPUPATD1_ACMP1_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_ACMP1_DEFAULT            (_SMU_PPUPATD1_ACMP1_DEFAULT << 12)       /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_AMUXCP0                  (0x1UL << 13)                             /**< AMUXCP0 Privileged Access                   */
#define _SMU_PPUPATD1_AMUXCP0_SHIFT           13                                        /**< Shift value for SMU_AMUXCP0                 */
#define _SMU_PPUPATD1_AMUXCP0_MASK            0x2000UL                                  /**< Bit mask for SMU_AMUXCP0                    */
#define _SMU_PPUPATD1_AMUXCP0_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_AMUXCP0_DEFAULT          (_SMU_PPUPATD1_AMUXCP0_DEFAULT << 13)     /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_VDAC0                    (0x1UL << 14)                             /**< VDAC0 Privileged Access                     */
#define _SMU_PPUPATD1_VDAC0_SHIFT             14                                        /**< Shift value for SMU_VDAC0                   */
#define _SMU_PPUPATD1_VDAC0_MASK              0x4000UL                                  /**< Bit mask for SMU_VDAC0                      */
#define _SMU_PPUPATD1_VDAC0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_VDAC0_DEFAULT            (_SMU_PPUPATD1_VDAC0_DEFAULT << 14)       /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_PCNT                     (0x1UL << 15)                             /**< PCNT Privileged Access                      */
#define _SMU_PPUPATD1_PCNT_SHIFT              15                                        /**< Shift value for SMU_PCNT                    */
#define _SMU_PPUPATD1_PCNT_MASK               0x8000UL                                  /**< Bit mask for SMU_PCNT                       */
#define _SMU_PPUPATD1_PCNT_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_PCNT_DEFAULT             (_SMU_PPUPATD1_PCNT_DEFAULT << 15)        /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_LESENSE                  (0x1UL << 16)                             /**< LESENSE Privileged Access                   */
#define _SMU_PPUPATD1_LESENSE_SHIFT           16                                        /**< Shift value for SMU_LESENSE                 */
#define _SMU_PPUPATD1_LESENSE_MASK            0x10000UL                                 /**< Bit mask for SMU_LESENSE                    */
#define _SMU_PPUPATD1_LESENSE_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_LESENSE_DEFAULT          (_SMU_PPUPATD1_LESENSE_DEFAULT << 16)     /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_HFRCO1                   (0x1UL << 17)                             /**< HFRCO1 Privileged Access                    */
#define _SMU_PPUPATD1_HFRCO1_SHIFT            17                                        /**< Shift value for SMU_HFRCO1                  */
#define _SMU_PPUPATD1_HFRCO1_MASK             0x20000UL                                 /**< Bit mask for SMU_HFRCO1                     */
#define _SMU_PPUPATD1_HFRCO1_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_HFRCO1_DEFAULT           (_SMU_PPUPATD1_HFRCO1_DEFAULT << 17)      /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_HFXO0                    (0x1UL << 18)                             /**< HFXO0 Privileged Access                     */
#define _SMU_PPUPATD1_HFXO0_SHIFT             18                                        /**< Shift value for SMU_HFXO0                   */
#define _SMU_PPUPATD1_HFXO0_MASK              0x40000UL                                 /**< Bit mask for SMU_HFXO0                      */
#define _SMU_PPUPATD1_HFXO0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_HFXO0_DEFAULT            (_SMU_PPUPATD1_HFXO0_DEFAULT << 18)       /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_I2C0                     (0x1UL << 19)                             /**< I2C0 Privileged Access                      */
#define _SMU_PPUPATD1_I2C0_SHIFT              19                                        /**< Shift value for SMU_I2C0                    */
#define _SMU_PPUPATD1_I2C0_MASK               0x80000UL                                 /**< Bit mask for SMU_I2C0                       */
#define _SMU_PPUPATD1_I2C0_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_I2C0_DEFAULT             (_SMU_PPUPATD1_I2C0_DEFAULT << 19)        /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_WDOG0                    (0x1UL << 20)                             /**< WDOG0 Privileged Access                     */
#define _SMU_PPUPATD1_WDOG0_SHIFT             20                                        /**< Shift value for SMU_WDOG0                   */
#define _SMU_PPUPATD1_WDOG0_MASK              0x100000UL                                /**< Bit mask for SMU_WDOG0                      */
#define _SMU_PPUPATD1_WDOG0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_WDOG0_DEFAULT            (_SMU_PPUPATD1_WDOG0_DEFAULT << 20)       /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_WDOG1                    (0x1UL << 21)                             /**< WDOG1 Privileged Access                     */
#define _SMU_PPUPATD1_WDOG1_SHIFT             21                                        /**< Shift value for SMU_WDOG1                   */
#define _SMU_PPUPATD1_WDOG1_MASK              0x200000UL                                /**< Bit mask for SMU_WDOG1                      */
#define _SMU_PPUPATD1_WDOG1_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_WDOG1_DEFAULT            (_SMU_PPUPATD1_WDOG1_DEFAULT << 21)       /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_EUSART0                  (0x1UL << 22)                             /**< EUSART0 Privileged Access                   */
#define _SMU_PPUPATD1_EUSART0_SHIFT           22                                        /**< Shift value for SMU_EUSART0                 */
#define _SMU_PPUPATD1_EUSART0_MASK            0x400000UL                                /**< Bit mask for SMU_EUSART0                    */
#define _SMU_PPUPATD1_EUSART0_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_EUSART0_DEFAULT          (_SMU_PPUPATD1_EUSART0_DEFAULT << 22)     /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_SEMAILBOX                (0x1UL << 23)                             /**< SEMAILBOX Privileged Access                 */
#define _SMU_PPUPATD1_SEMAILBOX_SHIFT         23                                        /**< Shift value for SMU_SEMAILBOX               */
#define _SMU_PPUPATD1_SEMAILBOX_MASK          0x800000UL                                /**< Bit mask for SMU_SEMAILBOX                  */
#define _SMU_PPUPATD1_SEMAILBOX_DEFAULT       0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_SEMAILBOX_DEFAULT        (_SMU_PPUPATD1_SEMAILBOX_DEFAULT << 23)   /**< Shifted mode DEFAULT for SMU_PPUPATD1       */
#define SMU_PPUPATD1_MVP                      (0x1UL << 24)                             /**< MVP Privileged Access                       */
#define _SMU_PPUPATD1_MVP_SHIFT               24                                        /**< Shift value for SMU_MVP                     */
#define _SMU_PPUPATD1_MVP_MASK                0x1000000UL                               /**< Bit mask for SMU_MVP                        */
#define _SMU_PPUPATD1_MVP_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUPATD1               */
#define SMU_PPUPATD1_MVP_DEFAULT              (_SMU_PPUPATD1_MVP_DEFAULT << 24)         /**< Shifted mode DEFAULT for SMU_PPUPATD1       */

