SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_smu.h
/* Bit fields for SMU PPUSATD1 */
#define _SMU_PPUSATD1_RESETVALUE              0x03FFFFFFUL                              /**< Default value for SMU_PPUSATD1              */
#define _SMU_PPUSATD1_MASK                    0x03FFFFFFUL                              /**< Mask for SMU_PPUSATD1                       */
#define SMU_PPUSATD1_SYSRTC                   (0x1UL << 0)                              /**< SYSRTC Secure Access                        */
#define _SMU_PPUSATD1_SYSRTC_SHIFT            0                                         /**< Shift value for SMU_SYSRTC                  */
#define _SMU_PPUSATD1_SYSRTC_MASK             0x1UL                                     /**< Bit mask for SMU_SYSRTC                     */
#define _SMU_PPUSATD1_SYSRTC_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_SYSRTC_DEFAULT           (_SMU_PPUSATD1_SYSRTC_DEFAULT << 0)       /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_LCD                      (0x1UL << 1)                              /**< LCD Secure Access                           */
#define _SMU_PPUSATD1_LCD_SHIFT               1                                         /**< Shift value for SMU_LCD                     */
#define _SMU_PPUSATD1_LCD_MASK                0x2UL                                     /**< Bit mask for SMU_LCD                        */
#define _SMU_PPUSATD1_LCD_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_LCD_DEFAULT              (_SMU_PPUSATD1_LCD_DEFAULT << 1)          /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_KEYSCAN                  (0x1UL << 2)                              /**< KEYSCAN Secure Access                       */
#define _SMU_PPUSATD1_KEYSCAN_SHIFT           2                                         /**< Shift value for SMU_KEYSCAN                 */
#define _SMU_PPUSATD1_KEYSCAN_MASK            0x4UL                                     /**< Bit mask for SMU_KEYSCAN                    */
#define _SMU_PPUSATD1_KEYSCAN_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_KEYSCAN_DEFAULT          (_SMU_PPUSATD1_KEYSCAN_DEFAULT << 2)      /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_DMEM                     (0x1UL << 3)                              /**< DMEM Secure Access                          */
#define _SMU_PPUSATD1_DMEM_SHIFT              3                                         /**< Shift value for SMU_DMEM                    */
#define _SMU_PPUSATD1_DMEM_MASK               0x8UL                                     /**< Bit mask for SMU_DMEM                       */
#define _SMU_PPUSATD1_DMEM_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_DMEM_DEFAULT             (_SMU_PPUSATD1_DMEM_DEFAULT << 3)         /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_SMU                      (0x1UL << 7)                              /**< SMU Secure Access                           */
#define _SMU_PPUSATD1_SMU_SHIFT               7                                         /**< Shift value for SMU_SMU                     */
#define _SMU_PPUSATD1_SMU_MASK                0x80UL                                    /**< Bit mask for SMU_SMU                        */
#define _SMU_PPUSATD1_SMU_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_SMU_DEFAULT              (_SMU_PPUSATD1_SMU_DEFAULT << 7)          /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_SMUCFGNS                 (0x1UL << 8)                              /**< SMUCFGNS Secure Access                      */
#define _SMU_PPUSATD1_SMUCFGNS_SHIFT          8                                         /**< Shift value for SMU_SMUCFGNS                */
#define _SMU_PPUSATD1_SMUCFGNS_MASK           0x100UL                                   /**< Bit mask for SMU_SMUCFGNS                   */
#define _SMU_PPUSATD1_SMUCFGNS_DEFAULT        0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_SMUCFGNS_DEFAULT         (_SMU_PPUSATD1_SMUCFGNS_DEFAULT << 8)     /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_LETIMER0                 (0x1UL << 9)                              /**< LETIMER0 Secure Access                      */
#define _SMU_PPUSATD1_LETIMER0_SHIFT          9                                         /**< Shift value for SMU_LETIMER0                */
#define _SMU_PPUSATD1_LETIMER0_MASK           0x200UL                                   /**< Bit mask for SMU_LETIMER0                   */
#define _SMU_PPUSATD1_LETIMER0_DEFAULT        0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_LETIMER0_DEFAULT         (_SMU_PPUSATD1_LETIMER0_DEFAULT << 9)     /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_IADC0                    (0x1UL << 10)                             /**< IADC0 Secure Access                         */
#define _SMU_PPUSATD1_IADC0_SHIFT             10                                        /**< Shift value for SMU_IADC0                   */
#define _SMU_PPUSATD1_IADC0_MASK              0x400UL                                   /**< Bit mask for SMU_IADC0                      */
#define _SMU_PPUSATD1_IADC0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_IADC0_DEFAULT            (_SMU_PPUSATD1_IADC0_DEFAULT << 10)       /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_ACMP0                    (0x1UL << 11)                             /**< ACMP0 Secure Access                         */
#define _SMU_PPUSATD1_ACMP0_SHIFT             11                                        /**< Shift value for SMU_ACMP0                   */
#define _SMU_PPUSATD1_ACMP0_MASK              0x800UL                                   /**< Bit mask for SMU_ACMP0                      */
#define _SMU_PPUSATD1_ACMP0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_ACMP0_DEFAULT            (_SMU_PPUSATD1_ACMP0_DEFAULT << 11)       /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_ACMP1                    (0x1UL << 12)                             /**< ACMP1 Secure Access                         */
#define _SMU_PPUSATD1_ACMP1_SHIFT             12                                        /**< Shift value for SMU_ACMP1                   */
#define _SMU_PPUSATD1_ACMP1_MASK              0x1000UL                                  /**< Bit mask for SMU_ACMP1                      */
#define _SMU_PPUSATD1_ACMP1_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_ACMP1_DEFAULT            (_SMU_PPUSATD1_ACMP1_DEFAULT << 12)       /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_AMUXCP0                  (0x1UL << 13)                             /**< AMUXCP0 Secure Access                       */
#define _SMU_PPUSATD1_AMUXCP0_SHIFT           13                                        /**< Shift value for SMU_AMUXCP0                 */
#define _SMU_PPUSATD1_AMUXCP0_MASK            0x2000UL                                  /**< Bit mask for SMU_AMUXCP0                    */
#define _SMU_PPUSATD1_AMUXCP0_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_AMUXCP0_DEFAULT          (_SMU_PPUSATD1_AMUXCP0_DEFAULT << 13)     /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_VDAC0                    (0x1UL << 14)                             /**< VDAC0 Secure Access                         */
#define _SMU_PPUSATD1_VDAC0_SHIFT             14                                        /**< Shift value for SMU_VDAC0                   */
#define _SMU_PPUSATD1_VDAC0_MASK              0x4000UL                                  /**< Bit mask for SMU_VDAC0                      */
#define _SMU_PPUSATD1_VDAC0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_VDAC0_DEFAULT            (_SMU_PPUSATD1_VDAC0_DEFAULT << 14)       /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_PCNT                     (0x1UL << 15)                             /**< PCNT Secure Access                          */
#define _SMU_PPUSATD1_PCNT_SHIFT              15                                        /**< Shift value for SMU_PCNT                    */
#define _SMU_PPUSATD1_PCNT_MASK               0x8000UL                                  /**< Bit mask for SMU_PCNT                       */
#define _SMU_PPUSATD1_PCNT_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_PCNT_DEFAULT             (_SMU_PPUSATD1_PCNT_DEFAULT << 15)        /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_LESENSE                  (0x1UL << 16)                             /**< LESENSE Secure Access                       */
#define _SMU_PPUSATD1_LESENSE_SHIFT           16                                        /**< Shift value for SMU_LESENSE                 */
#define _SMU_PPUSATD1_LESENSE_MASK            0x10000UL                                 /**< Bit mask for SMU_LESENSE                    */
#define _SMU_PPUSATD1_LESENSE_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_LESENSE_DEFAULT          (_SMU_PPUSATD1_LESENSE_DEFAULT << 16)     /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_HFRCO1                   (0x1UL << 17)                             /**< HFRCO1 Secure Access                        */
#define _SMU_PPUSATD1_HFRCO1_SHIFT            17                                        /**< Shift value for SMU_HFRCO1                  */
#define _SMU_PPUSATD1_HFRCO1_MASK             0x20000UL                                 /**< Bit mask for SMU_HFRCO1                     */
#define _SMU_PPUSATD1_HFRCO1_DEFAULT          0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_HFRCO1_DEFAULT           (_SMU_PPUSATD1_HFRCO1_DEFAULT << 17)      /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_HFXO0                    (0x1UL << 18)                             /**< HFXO0 Secure Access                         */
#define _SMU_PPUSATD1_HFXO0_SHIFT             18                                        /**< Shift value for SMU_HFXO0                   */
#define _SMU_PPUSATD1_HFXO0_MASK              0x40000UL                                 /**< Bit mask for SMU_HFXO0                      */
#define _SMU_PPUSATD1_HFXO0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_HFXO0_DEFAULT            (_SMU_PPUSATD1_HFXO0_DEFAULT << 18)       /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_I2C0                     (0x1UL << 19)                             /**< I2C0 Secure Access                          */
#define _SMU_PPUSATD1_I2C0_SHIFT              19                                        /**< Shift value for SMU_I2C0                    */
#define _SMU_PPUSATD1_I2C0_MASK               0x80000UL                                 /**< Bit mask for SMU_I2C0                       */
#define _SMU_PPUSATD1_I2C0_DEFAULT            0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_I2C0_DEFAULT             (_SMU_PPUSATD1_I2C0_DEFAULT << 19)        /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_WDOG0                    (0x1UL << 20)                             /**< WDOG0 Secure Access                         */
#define _SMU_PPUSATD1_WDOG0_SHIFT             20                                        /**< Shift value for SMU_WDOG0                   */
#define _SMU_PPUSATD1_WDOG0_MASK              0x100000UL                                /**< Bit mask for SMU_WDOG0                      */
#define _SMU_PPUSATD1_WDOG0_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_WDOG0_DEFAULT            (_SMU_PPUSATD1_WDOG0_DEFAULT << 20)       /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_WDOG1                    (0x1UL << 21)                             /**< WDOG1 Secure Access                         */
#define _SMU_PPUSATD1_WDOG1_SHIFT             21                                        /**< Shift value for SMU_WDOG1                   */
#define _SMU_PPUSATD1_WDOG1_MASK              0x200000UL                                /**< Bit mask for SMU_WDOG1                      */
#define _SMU_PPUSATD1_WDOG1_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_WDOG1_DEFAULT            (_SMU_PPUSATD1_WDOG1_DEFAULT << 21)       /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_EUSART0                  (0x1UL << 22)                             /**< EUSART0 Secure Access                       */
#define _SMU_PPUSATD1_EUSART0_SHIFT           22                                        /**< Shift value for SMU_EUSART0                 */
#define _SMU_PPUSATD1_EUSART0_MASK            0x400000UL                                /**< Bit mask for SMU_EUSART0                    */
#define _SMU_PPUSATD1_EUSART0_DEFAULT         0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_EUSART0_DEFAULT          (_SMU_PPUSATD1_EUSART0_DEFAULT << 22)     /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_SEMAILBOX                (0x1UL << 23)                             /**< SEMAILBOX Secure Access                     */
#define _SMU_PPUSATD1_SEMAILBOX_SHIFT         23                                        /**< Shift value for SMU_SEMAILBOX               */
#define _SMU_PPUSATD1_SEMAILBOX_MASK          0x800000UL                                /**< Bit mask for SMU_SEMAILBOX                  */
#define _SMU_PPUSATD1_SEMAILBOX_DEFAULT       0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_SEMAILBOX_DEFAULT        (_SMU_PPUSATD1_SEMAILBOX_DEFAULT << 23)   /**< Shifted mode DEFAULT for SMU_PPUSATD1       */
#define SMU_PPUSATD1_MVP                      (0x1UL << 24)                             /**< MVP Secure Access                           */
#define _SMU_PPUSATD1_MVP_SHIFT               24                                        /**< Shift value for SMU_MVP                     */
#define _SMU_PPUSATD1_MVP_MASK                0x1000000UL                               /**< Bit mask for SMU_MVP                        */
#define _SMU_PPUSATD1_MVP_DEFAULT             0x00000001UL                              /**< Mode DEFAULT for SMU_PPUSATD1               */
#define SMU_PPUSATD1_MVP_DEFAULT              (_SMU_PPUSATD1_MVP_DEFAULT << 24)         /**< Shifted mode DEFAULT for SMU_PPUSATD1       */

/* Bit fields for SMU PPUFS */
#define _SMU_PPUFS_RESETVALUE                 0x00000000UL                              /**< Default value for SMU_PPUFS                 */
#define _SMU_PPUFS_MASK                       0x000000FFUL                              /**< Mask for SMU_PPUFS                          */
#define _SMU_PPUFS_PPUFSPERIPHID_SHIFT        0                                         /**< Shift value for SMU_PPUFSPERIPHID           */
#define _SMU_PPUFS_PPUFSPERIPHID_MASK         0xFFUL                                    /**< Bit mask for SMU_PPUFSPERIPHID              */
#define _SMU_PPUFS_PPUFSPERIPHID_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for SMU_PPUFS                  */
#define SMU_PPUFS_PPUFSPERIPHID_DEFAULT       (_SMU_PPUFS_PPUFSPERIPHID_DEFAULT << 0)   /**< Shifted mode DEFAULT for SMU_PPUFS          */

/* Bit fields for SMU BMPUPATD0 */
#define _SMU_BMPUPATD0_RESETVALUE             0x000001FFUL                              /**< Default value for SMU_BMPUPATD0             */
#define _SMU_BMPUPATD0_MASK                   0x000001FFUL                              /**< Mask for SMU_BMPUPATD0                      */
#define SMU_BMPUPATD0_LDMA                    (0x1UL << 2)                              /**< MCU LDMA privileged mode                    */
#define _SMU_BMPUPATD0_LDMA_SHIFT             2                                         /**< Shift value for SMU_LDMA                    */
#define _SMU_BMPUPATD0_LDMA_MASK              0x4UL                                     /**< Bit mask for SMU_LDMA                       */
#define _SMU_BMPUPATD0_LDMA_DEFAULT           0x00000001UL                              /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_LDMA_DEFAULT            (_SMU_BMPUPATD0_LDMA_DEFAULT << 2)        /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_MVPAHBDATA0             (0x1UL << 3)                              /**< MVPAHBDATA0 privileged mode                 */
#define _SMU_BMPUPATD0_MVPAHBDATA0_SHIFT      3                                         /**< Shift value for SMU_MVPAHBDATA0             */
#define _SMU_BMPUPATD0_MVPAHBDATA0_MASK       0x8UL                                     /**< Bit mask for SMU_MVPAHBDATA0                */
#define _SMU_BMPUPATD0_MVPAHBDATA0_DEFAULT    0x00000001UL                              /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_MVPAHBDATA0_DEFAULT     (_SMU_BMPUPATD0_MVPAHBDATA0_DEFAULT << 3) /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_MVPAHBDATA1             (0x1UL << 4)                              /**< MVPAHBDATA1 privileged mode                 */
#define _SMU_BMPUPATD0_MVPAHBDATA1_SHIFT      4                                         /**< Shift value for SMU_MVPAHBDATA1             */
#define _SMU_BMPUPATD0_MVPAHBDATA1_MASK       0x10UL                                    /**< Bit mask for SMU_MVPAHBDATA1                */
#define _SMU_BMPUPATD0_MVPAHBDATA1_DEFAULT    0x00000001UL                              /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_MVPAHBDATA1_DEFAULT     (_SMU_BMPUPATD0_MVPAHBDATA1_DEFAULT << 4) /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_MVPAHBDATA2             (0x1UL << 5)                              /**< MVPAHBDATA2 privileged mode                 */
#define _SMU_BMPUPATD0_MVPAHBDATA2_SHIFT      5                                         /**< Shift value for SMU_MVPAHBDATA2             */
#define _SMU_BMPUPATD0_MVPAHBDATA2_MASK       0x20UL                                    /**< Bit mask for SMU_MVPAHBDATA2                */
#define _SMU_BMPUPATD0_MVPAHBDATA2_DEFAULT    0x00000001UL                              /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_MVPAHBDATA2_DEFAULT     (_SMU_BMPUPATD0_MVPAHBDATA2_DEFAULT << 5) /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */
#define SMU_BMPUPATD0_SEEXTDMA                (0x1UL << 8)                              /**< SEEXTDMA privileged mode                    */
#define _SMU_BMPUPATD0_SEEXTDMA_SHIFT         8                                         /**< Shift value for SMU_SEEXTDMA                */
#define _SMU_BMPUPATD0_SEEXTDMA_MASK          0x100UL                                   /**< Bit mask for SMU_SEEXTDMA                   */
#define _SMU_BMPUPATD0_SEEXTDMA_DEFAULT       0x00000001UL                              /**< Mode DEFAULT for SMU_BMPUPATD0              */
#define SMU_BMPUPATD0_SEEXTDMA_DEFAULT        (_SMU_BMPUPATD0_SEEXTDMA_DEFAULT << 8)    /**< Shifted mode DEFAULT for SMU_BMPUPATD0      */

