SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFM32PG28/Include/efm32pg28_smu.h
/* Bit fields for SMU PPUNSFS */
#define _SMU_PPUNSFS_RESETVALUE                 0x00000000UL                              /**< Default value for SMU_PPUNSFS               */
#define _SMU_PPUNSFS_MASK                       0x000000FFUL                              /**< Mask for SMU_PPUNSFS                        */
#define _SMU_PPUNSFS_PPUFSPERIPHID_SHIFT        0                                         /**< Shift value for SMU_PPUFSPERIPHID           */
#define _SMU_PPUNSFS_PPUFSPERIPHID_MASK         0xFFUL                                    /**< Bit mask for SMU_PPUFSPERIPHID              */
#define _SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT      0x00000000UL                              /**< Mode DEFAULT for SMU_PPUNSFS                */
#define SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT       (_SMU_PPUNSFS_PPUFSPERIPHID_DEFAULT << 0) /**< Shifted mode DEFAULT for SMU_PPUNSFS        */

/* Bit fields for SMU BMPUNSPATD0 */
#define _SMU_BMPUNSPATD0_RESETVALUE             0x00000000UL                                /**< Default value for SMU_BMPUNSPATD0           */
#define _SMU_BMPUNSPATD0_MASK                   0x000001FFUL                                /**< Mask for SMU_BMPUNSPATD0                    */
#define SMU_BMPUNSPATD0_LDMA                    (0x1UL << 2)                                /**< MCU LDMA privileged mode                    */
#define _SMU_BMPUNSPATD0_LDMA_SHIFT             2                                           /**< Shift value for SMU_LDMA                    */
#define _SMU_BMPUNSPATD0_LDMA_MASK              0x4UL                                       /**< Bit mask for SMU_LDMA                       */
#define _SMU_BMPUNSPATD0_LDMA_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_LDMA_DEFAULT            (_SMU_BMPUNSPATD0_LDMA_DEFAULT << 2)        /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_MVPAHBDATA0             (0x1UL << 3)                                /**< MVPAHBDATA0 privileged mode                 */
#define _SMU_BMPUNSPATD0_MVPAHBDATA0_SHIFT      3                                           /**< Shift value for SMU_MVPAHBDATA0             */
#define _SMU_BMPUNSPATD0_MVPAHBDATA0_MASK       0x8UL                                       /**< Bit mask for SMU_MVPAHBDATA0                */
#define _SMU_BMPUNSPATD0_MVPAHBDATA0_DEFAULT    0x00000000UL                                /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_MVPAHBDATA0_DEFAULT     (_SMU_BMPUNSPATD0_MVPAHBDATA0_DEFAULT << 3) /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_MVPAHBDATA1             (0x1UL << 4)                                /**< MVPAHBDATA1 privileged mode                 */
#define _SMU_BMPUNSPATD0_MVPAHBDATA1_SHIFT      4                                           /**< Shift value for SMU_MVPAHBDATA1             */
#define _SMU_BMPUNSPATD0_MVPAHBDATA1_MASK       0x10UL                                      /**< Bit mask for SMU_MVPAHBDATA1                */
#define _SMU_BMPUNSPATD0_MVPAHBDATA1_DEFAULT    0x00000000UL                                /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_MVPAHBDATA1_DEFAULT     (_SMU_BMPUNSPATD0_MVPAHBDATA1_DEFAULT << 4) /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_MVPAHBDATA2             (0x1UL << 5)                                /**< MVPAHBDATA2 privileged mode                 */
#define _SMU_BMPUNSPATD0_MVPAHBDATA2_SHIFT      5                                           /**< Shift value for SMU_MVPAHBDATA2             */
#define _SMU_BMPUNSPATD0_MVPAHBDATA2_MASK       0x20UL                                      /**< Bit mask for SMU_MVPAHBDATA2                */
#define _SMU_BMPUNSPATD0_MVPAHBDATA2_DEFAULT    0x00000000UL                                /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_MVPAHBDATA2_DEFAULT     (_SMU_BMPUNSPATD0_MVPAHBDATA2_DEFAULT << 5) /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */
#define SMU_BMPUNSPATD0_SEEXTDMA                (0x1UL << 8)                                /**< SEEXTDMA privileged mode                    */
#define _SMU_BMPUNSPATD0_SEEXTDMA_SHIFT         8                                           /**< Shift value for SMU_SEEXTDMA                */
#define _SMU_BMPUNSPATD0_SEEXTDMA_MASK          0x100UL                                     /**< Bit mask for SMU_SEEXTDMA                   */
#define _SMU_BMPUNSPATD0_SEEXTDMA_DEFAULT       0x00000000UL                                /**< Mode DEFAULT for SMU_BMPUNSPATD0            */
#define SMU_BMPUNSPATD0_SEEXTDMA_DEFAULT        (_SMU_BMPUNSPATD0_SEEXTDMA_DEFAULT << 8)    /**< Shifted mode DEFAULT for SMU_BMPUNSPATD0    */

/** @} End of group EFM32PG28_SMU_CFGNS_BitFields */
/** @} End of group EFM32PG28_SMU_CFGNS */
/** @} End of group Parts */

#endif /* EFM32PG28_SMU_H */
